[Timeout] ArrayDeclaration
src/Roller.ts:5:30
   private _distribution: Map<number, number>;
   private _last: number;
   private _faces: number;
-  private _rolls: number[] = [];
+  private _rolls: number[] = ["Stryker was here"];
 
 

[Timeout] BlockStatement
src/Roller.ts:17:42
 
   //This constructor sets _faces to 6 if the faces parameter is undefined or less than 2.
   // It also initializes the _distribution map with keys from 1 to _faces, and values of 0. Finally, it sets _last to 0.
-  constructor(faces: number | undefined) {
-      if (faces === undefined || faces < 2) {
-        this._faces = 6;
-      } else {
-        this._faces = faces;
-      }
-      this._distribution = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) {
-        this._distribution.set(i, 0);
-      }
-      this._last = 0;
-    }
+  constructor(faces: number | undefined) {}
 
   // specifies which number should be rolled and returns the recorded roll. 

[Timeout] EqualityOperator
src/Roller.ts:18:34
   //This constructor sets _faces to 6 if the faces parameter is undefined or less than 2.
   // It also initializes the _distribution map with keys from 1 to _faces, and values of 0. Finally, it sets _last to 0.
   constructor(faces: number | undefined) {
-      if (faces === undefined || faces < 2) {
+      if (faces === undefined || faces >= 2) {
         this._faces = 6;
       } else {

[Timeout] LogicalOperator
src/Roller.ts:18:11
   //This constructor sets _faces to 6 if the faces parameter is undefined or less than 2.
   // It also initializes the _distribution map with keys from 1 to _faces, and values of 0. Finally, it sets _last to 0.
   constructor(faces: number | undefined) {
-      if (faces === undefined || faces < 2) {
+      if (faces === undefined && faces < 2) {
         this._faces = 6;
       } else {

[Timeout] EqualityOperator
src/Roller.ts:24:23
         this._faces = faces;
       }
       this._distribution = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) {
+      for (let i = 1; i > this._faces; i++) {
         this._distribution.set(i, 0);
       }

[Timeout] BlockStatement
src/Roller.ts:44:30
   //     return value;
   // }
 
-  roll(value: number): number{
-      if (value >= 1 && value <= this._faces) {
-        this._last = value;
-        const count = this._distribution.get(value) || 0;
-        this._distribution.set(value, count + 1);
-        this._rolls.push(value);
-
-        return value;
-      } else {
-        return 0;
-      }
-    }
+  roll(value: number): number{}
 
   // returns the value of the latest die roll. If no rolls have been made

[Timeout] ConditionalExpression
src/Roller.ts:45:11
   // }
 
   roll(value: number): number{
-      if (value >= 1 && value <= this._faces) {
+      if (true) {
         this._last = value;
         const count = this._distribution.get(value) || 0;

[Timeout] ConditionalExpression
src/Roller.ts:45:11
   // }
 
   roll(value: number): number{
-      if (value >= 1 && value <= this._faces) {
+      if (true && value <= this._faces) {
         this._last = value;
         const count = this._distribution.get(value) || 0;

[Timeout] ConditionalExpression
src/Roller.ts:47:23
   roll(value: number): number{
       if (value >= 1 && value <= this._faces) {
         this._last = value;
-        const count = this._distribution.get(value) || 0;
+        const count = false;
         this._distribution.set(value, count + 1);
         this._rolls.push(value);

[Timeout] ConditionalExpression
src/Roller.ts:47:23
   roll(value: number): number{
       if (value >= 1 && value <= this._faces) {
         this._last = value;
-        const count = this._distribution.get(value) || 0;
+        const count = true;
         this._distribution.set(value, count + 1);
         this._rolls.push(value);

[Timeout] ArithmeticOperator
src/Roller.ts:48:39
       if (value >= 1 && value <= this._faces) {
         this._last = value;
         const count = this._distribution.get(value) || 0;
-        this._distribution.set(value, count + 1);
+        this._distribution.set(value, count - 1);
         this._rolls.push(value);
 

[Timeout] BlockStatement
src/Roller.ts:76:39
   //     return new Map<number, number>();
   // }
 
-  distribution(): Map<number, number> {
-      const result = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) {
-        result.set(i, 0);
-      }
-      this._rolls.forEach((roll) => {
-        result.set(roll, result.get(roll)! + 1);
-      });
-      return result;
-    }
+  distribution(): Map<number, number> {}
 
 } // end of Roller class

[Timeout] ConditionalExpression
src/Roller.ts:78:23
 
   distribution(): Map<number, number> {
       const result = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) {
+      for (let i = 1; false; i++) {
         result.set(i, 0);
       }

[Timeout] UpdateOperator
src/Roller.ts:78:41
 
   distribution(): Map<number, number> {
       const result = new Map<number, number>();
-      for (let i = 1; i <= this._faces; i++) {
+      for (let i = 1; i <= this._faces; i--) {
         result.set(i, 0);
       }

[Timeout] BlockStatement
src/Roller.ts:81:37
       for (let i = 1; i <= this._faces; i++) {
         result.set(i, 0);
       }
-      this._rolls.forEach((roll) => {
-        result.set(roll, result.get(roll)! + 1);
-      });
+      this._rolls.forEach((roll) => {});
       return result;
     }

[Timeout] ArithmeticOperator
src/Roller.ts:82:26
         result.set(i, 0);
       }
       this._rolls.forEach((roll) => {
-        result.set(roll, result.get(roll)! + 1);
+        result.set(roll, result.get(roll)! - 1);
       });
       return result;
